In [8]:
import pandas as pd
import numpy as np

In [19]:
usa = pd.read_csv('../Team Selection/team_from_ind_scores.csv')

In [20]:
usa

,Algorithm,Athletes,Score Type,Score
0,Variable Neighborhood Search (VNS),"['Jordan Chiles', 'Joscelyn Roberson', 'Shiles...",Total Score,168.998125
1,Hyper-Heuristics,"['Joscelyn Roberson', 'Simone Biles', 'Shilese...",Best Score,168.422350
2,Tabu Search,"['Simone Biles', 'Shilese Jones', 'Zoe Miller'...",Total Score,169.719089
3,Brute Force,"['Ashlee Sullivan', 'Jordan Chiles', 'Shilese ...",Maximum Score,168.422350

In [11]:
df = pd.read_csv('../Team Selection/Competition/top_countries.csv')

In [12]:
df

,Country,Algorithm,Athletes,Score
0,Great Britain,VNS,"['ondine achampong', 'alice kinsella', 'jessic...",167.763
1,France,vns,"['aline friess', 'mélanie de jesus dos santos'...",164.763
2,China,vns,"['ou yushan', 'qiu qiyuan', 'tang xijing', 'zh...",166.965
3,Canada,VNS,"['ava stewart', 'ellie black', 'laurie denommé...",159.562
4,Brazil,vns,"['rebeca andrade', 'julia soares', 'flavia sar...",164.995

In [22]:
df = df.sort_values(by='Score', ascending=False)

In [23]:
df

,Country,Algorithm,Athletes,Score
0,Great Britain,VNS,"['ondine achampong', 'alice kinsella', 'jessic...",167.763
2,China,vns,"['ou yushan', 'qiu qiyuan', 'tang xijing', 'zh...",166.965
4,Brazil,vns,"['rebeca andrade', 'julia soares', 'flavia sar...",164.995
1,France,vns,"['aline friess', 'mélanie de jesus dos santos'...",164.763
3,Canada,VNS,"['ava stewart', 'ellie black', 'laurie denommé...",159.562

In [24]:
usa = usa.sort_values(by='Score', ascending=False)

In [26]:
usa=usa.drop(columns=['Score Type'])

In [27]:
usa

,Algorithm,Athletes,Score
2,Tabu Search,"['Simone Biles', 'Shilese Jones', 'Zoe Miller'...",169.719089
0,Variable Neighborhood Search (VNS),"['Jordan Chiles', 'Joscelyn Roberson', 'Shiles...",168.998125
1,Hyper-Heuristics,"['Joscelyn Roberson', 'Simone Biles', 'Shilese...",168.422350
3,Brute Force,"['Ashlee Sullivan', 'Jordan Chiles', 'Shilese ...",168.422350